<a href="https://colab.research.google.com/github/vapaul10/DESC624PredictiveAnalytics/blob/Week3/Week1_DueWk3_Homework.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [136]:
###Below is the homework for this section

In [137]:
#1  Import Libraries and Data Sources
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import datasets
import matplotlib.pyplot as plt
import pandas as pd
#importing the necessary packages
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import MultinomialNB
from matplotlib import rcParams
from sklearn import svm

from inspect import signature

import sklearn
from sklearn import linear_model, dummy, metrics
from sklearn.dummy import DummyClassifier
from sklearn.metrics import *

import seaborn as sns

In [138]:
#2  Import ssl
import ssl

ssl._create_default_https_context = ssl._create_unverified_context

In [139]:
#  1- 2  Import data Continues from above
### training Adult_ch3_training import

url = 'https://raw.githubusercontent.com/vapaul10/DESC624PredictiveAnalytics/Datasets/adult_ch3_training.csv'
col=['age', 'workclass', 'education', 'marital-status', 'occupation', 'sex', 'capital-gain', 'capital-loss', 'income'] 

bank_train = pd.read_csv(url)

# Print first 5 row of the dataframe
bank_train.head(10)

   age         workclass  education  ... capital-gain capital-loss income
0   50  Self-emp-not-inc         13  ...            0            0  <=50K
1   38           Private          9  ...            0            0  <=50K
2   49           Private          5  ...            0            0  <=50K
3   52  Self-emp-not-inc          9  ...            0            0   >50K
4   31           Private         14  ...        14084            0   >50K
5   40           Private         11  ...            0            0   >50K
6   38           Private          7  ...            0            0  <=50K
7   43           Private          7  ...            0         2042  <=50K
8   54                 ?         10  ...            0            0   >50K
9   39           Private          9  ...            0            0  <=50K

[10 rows x 9 columns]

In [144]:
###3 Setup  .Shape tells the number of Records:  14,797 and 9 Fields  p. 32
### Important to set-up contingency table
bank_train.shape

(14797, 10)

In [145]:
### 3  Set-up  This assigns every record a unique integer. ID p. 32
###  The nested commands Series() and range() create a string of numbers whose lower bound is zero and upper bound is the number of records.
 
bank_train['index'] = pd.Series(range(0,14797))

bank_train.head()

   age         workclass  education  ... capital-loss income index
0   50  Self-emp-not-inc         13  ...            0  <=50K     0
1   38           Private          9  ...            0  <=50K     1
2   49           Private          5  ...            0  <=50K     2
3   52  Self-emp-not-inc          9  ...            0   >50K     3
4   31           Private         14  ...            0   >50K     4

[5 rows x 10 columns]

In [148]:
###3  .head  
### To view the data set with its new variable, we can look at the head of the data set.  p. 32
### notice the output different between bank_train.head() and bank_train.head

bank_train.head

<bound method NDFrame.head of        age         workclass  education  ... capital-loss income  index
0       50  Self-emp-not-inc         13  ...            0  <=50K      0
1       38           Private          9  ...            0  <=50K      1
2       49           Private          5  ...            0  <=50K      2
3       52  Self-emp-not-inc          9  ...            0   >50K      3
4       31           Private         14  ...            0   >50K      4
...    ...               ...        ...  ...          ...    ...    ...
14792   43  Self-emp-not-inc         10  ...            0  <=50K  14792
14793   32           Private          6  ...            0  <=50K  14793
14794   32           Private         14  ...            0  <=50K  14794
14795   58           Private          9  ...            0  <=50K  14795
14796   22           Private          9  ...            0  <=50K  14796

[14797 rows x 10 columns]>

In [149]:
### 3   Setup .unique To tell the different in types of 
###      a categories within the field  'marital-status' (7)
###      array(['marital-status', 'Married-civ-spouse', 'Divorced',
###       'Married-spouse-absent', 'Never-married', 'Married-AF-spouse',
###        'Separated', 'Widowed'], dtype=object)

bank_train['marital-status'].unique()

array(['Married-civ-spouse', 'Divorced', 'Married-spouse-absent',
       'Never-married', 'Married-AF-spouse', 'Separated', 'Widowed'],
      dtype=object)

#1 Step to Bar Graph  p 49
The first step in creating a bar graph is to create a contingency table of the values in the predictor and target variables. We create the table using the crosstab() command.

In [95]:
# 3  Setup  bank_train2  single or married only 0 and 1 
bank_train2 = bank_train
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Never-married': '0'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Married-civ-spouse': '1'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Married-spouse-absent': '1'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Married-AF-spouse': '1'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Separated': '0'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Widowed': '0'})
bank_train2['marital-status'] = bank_train2['marital-status'].replace({'Divorced': '0'})
bank_train2.head()

   age         workclass  education  ... capital-loss income index
0   50  Self-emp-not-inc         13  ...            0  <=50K     0
1   38           Private          9  ...            0  <=50K     1
2   49           Private          5  ...            0  <=50K     2
3   52  Self-emp-not-inc          9  ...            0   >50K     3
4   31           Private         14  ...            0   >50K     4

[5 rows x 10 columns]

In [150]:
# 3  Setup  df3
bank_train3 = bank_train
bank_train3['income'] = bank_train3['income'].replace({'<=50K': 0})
bank_train3['income'] = bank_train3['income'].replace({'>50K': 1})
bank_train3.head()

   age         workclass  education  ... capital-loss income index
0   50  Self-emp-not-inc         13  ...            0      0     0
1   38           Private          9  ...            0      0     1
2   49           Private          5  ...            0      0     2
3   52  Self-emp-not-inc          9  ...            0      1     3
4   31           Private         14  ...            0      1     4

[5 rows x 10 columns]

In [151]:
# 3  Setup  Marital Status and Age
### After changing Married Status to Binary we Cross Reference to the Other Variable
### Use Crosstab()
#CrossTabs
crosstab_01 = pd.crosstab(bank_train2['age'], bank_train2['marital-status'])
crosstab_01['Total'] = tl.sum(axis=1)
crosstab_01.loc['Total'] = tl.sum()
crosstab_01

marital-status      0     1    Total
age
17              187.0   1.0      NaN
18              234.0   6.0      NaN
19              315.0   9.0      NaN
20              319.0  19.0      NaN
21              294.0  26.0      NaN
...               ...   ...      ...
86                1.0   0.0      NaN
87                1.0   0.0      NaN
88                1.0   1.0      NaN
90               13.0  10.0      NaN
Total             NaN   NaN  29596.0

[74 rows x 3 columns]

In [110]:
### Change or Remove to Change Misleading Field Values Using Python p. 34
bank_train['marital-status'] = bank_train['marital-status'].replace({999: np.NaN})

In [ ]:
bank_train2['marital-status'].plot(kind = 'bar', title = 'Histogram of Single and Married Candidates')

In [ ]:
#3a BarGraph of Martial
crosstab_01.plot[bank_train2(kind='bar', stacked = True)]

# Paul_Valeri Homework Wk 3
Please work on the following problems before checking the answers in the next element.

# 1 Import libraries and DS  
Use this data set. (adult_Training_3)
[link text](https://https://raw.githubusercontent.com/vapaul10/DESC624PredictiveAnalytics/Datasets/adult_ch3_training.csv)

# 2  Import ssl

# 3 Set-up Data to Produce the following graphs. What is the strength of each graph? Weakness?
  *3a   Bar graph of marital

  *3b   Bar graph of marital, with overlay of response

  *3c   Normalized bar graph of marital, with overlay of response

  *3d   Using the graph from the previous exercise, describe the relationship between marital and response.

  *3e  Strengths of data
  
  *3f  Weakness of Data

#4   Do the following with the variables marital and response.

  *4a  Build a contingency table, being careful to have the correct variables representing the rows and columns. Report the counts and the column percentages.

  *4b  Describe what the contingency table is telling you.

  *4c  Repeat the previous exercise, this time reporting the row percentages.

  *4d Explain the difference between the interpretation of this table and the previous contingency table.


#5  Produce the following graphs. What is the strength of each graph? Weakness?*
  *5a   Histogram of duration.

  *5b   Histogram of duration, with overlay of response.
  *5c   Normalized histogram of duration, with overlay of response.
  *5d   Using the graph from the previous exercise, describe the relationship between duration and response.

#6  Examine the nonnormalized and normalized histograms of duration, with overlay of response.
  *6a  Identify cutoff point(s) for duration, which separate low values of response from high values.
  *6b  Define a new categorical variable, duration_binned, using the cutoff points you identified.
  *6c  Provide the following. Describe each of the results.

#7  Contingency table of duration_binned with response, with counts and column percentages
  *7a  Nonnormalized bar graph of duration_binned, with response overlay.
  *7b  Normalized bar graph of duration_binned, with response overlay
  *7c  Construct a contingency table of job with response, with counts and column percentages.
  *7d  Referring to the previous exercise, do the following:

#8  Combine the job categories according to the following response percentages: 0 < 10, 10 < 25, 25 < 33. 
   *8a  Name the new variable job2.
   *8b  Provide a contingency table of job2 with response, with counts and column percentages.
   *8c  Describe what you see.
   *8d  Provide a normalized histogram of job2 with response. 
   *8e  Describe the relationship.